# 2.Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
# Объяснить полученный результат.


# a = 0101(5)
# b = 0110(6)
#
# Побитовое "И":
#     a & b = 0100 копирует бит в результат, если он присутствует в обоих сравниваемых
# Побитовое "ИЛИ":
#     a | b = 0111 копирует бит в результат, если он присутствует хотя бы в одном
# Побитовое "Исключающее ИЛИ":
#     a ^ b = 0011 копирует бит в результат, если он присутствует только в одном
#
# Побитовый сдвиг влево:
#     a << 2 = 0100
# Побитовый сдвиг вправо:
#     a >> 2 = 0001

